Public Attributes | List of all members
API_ElementQuantity Union Reference
Element Manager
Describes the different calculated values. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_WallQuantity  | wall
Describes the different calculated values for wall. API_WallQuantity.
 API_ColumnQuantity  | column
Describes the different calculated values for column. API_ColumnQuantity.
 API_BeamQuantity  | beam
Describes the different calculated values for beam. API_BeamQuantity.
 API_DoorQuantity  | door
Describes the different calculated values for door. API_DoorQuantity.
 API_WindowQuantity  | window
Describes the different calculated values for window. API_WindowQuantity.
 API_SkylightQuantity  | skylight
Describes the different calculated values for skylight. API_SkylightQuantity.
 API_ObjectQuantity  | symb
Describes the different calculated values for symb. API_ObjectQuantity.
 API_LightQuantity  | light
Describes the different calculated values for light. API_LightQuantity.
 API_SlabQuantity  | slab
Describes the different calculated values for slab. API_SlabQuantity.
 API_MeshQuantity  | mesh
Describes the different calculated values for mesh. API_MeshQuantity.
 API_RoofQuantity  | roof
Describes the different calculated values for roof. API_RoofQuantity.
 API_ShellQuantity  | shell
Describes the different calculated values for shell. API_ShellQuantity.
 API_MorphQuantity  | morph
Describes the different calculated values for morph. API_MorphQuantity.
 API_HatchQuantity  | hatch
Describes the different calculated values for hatch. API_HatchQuantity.
 API_ZoneAllQuantity  | zone
Describes the different calculated values for zone. API_ZoneAllQuantity.
 API_CurtainWallQuantity  | cw
Describes the different calculated values for curtain wall. API_CurtainWallQuantity.
 API_CWFrameQuantity  | cwFrame
Describes the different calculated values for frame of curtain wall. API_CWFrameQuantity.
 API_CWPanelQuantity  | cwPanel
Describes the different calculated values for panel of curtain wall. API_CWPanelQuantity.
 API_CWJunctionQuantity  | cwJunction
Describes the different calculated values for junction of curtain wall. API_CWJunctionQuantity.
 API_CWAccessoryQuantity  | cwAccessory
Describes the different calculated values for accessory of curtain wall. API_CWAccessoryQuantity.
 API_StairQuantity  | stair
Describes the different calculated values for stair s.
 API_StairRiserQuantity  | stairRiser
Describes the different calculated values for stair risers.
 API_StairTreadQuantity  | stairTread
Describes the different calculated values for stair treads.
 API_StairStructureQuantity  | stairStructure
Describes the different calculated values for stair structures.
 API_RailingQuantity  | railing
Describes the different calculated values for railings.
 API_RailingToprailQuantity  | railingToprail
Describes the different calculated values for railing toprails.
 API_RailingHandrailQuantity  | railingHandrail
Describes the different calculated values for railing handrails.
 API_RailingRailQuantity  | railingRail
Describes the different calculated values for railing rails.
 API_RailingToprailEndQuantity  | railingToprailEnd
Describes the different calculated values for railing toprail ends.
 API_RailingHandrailEndQuantity  | railingHandrailEnd
Describes the different calculated values for railing handrail ends.
 API_RailingRailEndQuantity  | railingRailEnd
Describes the different calculated values for railing rail ends.
 API_RailingToprailConnectionQuantity  | railingToprailConnection
Describes the different calculated values for railing toprail connections.
 API_RailingHandrailConnectionQuantity  | railingHandrailConnection
Describes the different calculated values for railing handrail connections.
 API_RailingRailConnectionQuantity  | railingRailConnection
Describes the different calculated values for railing rail connections.
 API_RailingPostQuantity  | railingPost
Describes the different calculated values for railing posts.
 API_RailingInnerPostQuantity  | railingInnerPost
Describes the different calculated values for railing inner posts.
 API_RailingBalusterQuantity  | railingBaluster
Describes the different calculated values for railing balusters.
 API_RailingPanelQuantity  | railingPanel
Describes the different calculated values for railing panels.
 API_RailingSegmentQuantity  | railingSegment
Describes the different calculated values for railing segments.
 API_ColumnSegmentQuantity  | columnSegment
Describes the different calculated values for column segments.
 API_BeamSegmentQuantity  | beamSegment
Describes the different calculated values for beam segments.
Detailed Description
Describes the different calculated values.